app/views/v2/qbe/getMinPrem.xml.erb

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:proc="<%= Rails.application.credentials.qbe[:uri][ENV['RAILS_ENV'].to_sym] %>">
  <soapenv:Header/>
  <soapenv:Body>
    <proc:processRenterRequest>
      <xmldata>
        <![CDATA[
          <?xml version="1.0" encoding="UTF-8"?>
          <renters_request version="1.0">
            <heading>
              <program name="<%= request[:heading][:program][:name] %>" requesttimestamp="<%= request[:heading][:program][:requesttimestamp] %>" ClientName="<%= request[:heading][:program][:ClientName] %>"/>
            </heading>
            <request type="Quote">
              <senderID><%= request[:data][:senderID] %></senderID>
              <receiverID>32917</receiverID>
              <agent_id><%= request[:data][:agent_id] %></agent_id>
              <current_system_date><%= request[:data][:agent_id] %></current_system_date>
              <prop_city><%= request[:data][:prop_city] %></prop_city>
              <prop_county><%= request[:data][:prop_county] %></prop_county>
              <prop_state><%= request[:data][:prop_state] %></prop_state>
              <prop_zipcode><%= request[:data][:prop_zipcode] %></prop_zipcode>
              <city_limit><%= request[:data][:city_limit] %></city_limit>
              <pref_facility><%= request[:data][:pref_facility] %></pref_facility>
              <occupancy_type><%= request[:data][:occupancy_type] %></occupancy_type>
              <units_on_site><%= request[:data][:units_on_site] %></units_on_site>
              <age_of_facility><%= request[:data][:age_of_facility] %></age_of_facility>
              <gated_community><%= request[:data][:gated_community] %></gated_community>
              <prof_managed><%= request[:data][:prof_managed] %></prof_managed>
              <prof_managed_year><%= request[:data][:prof_managed_year] %></prof_managed_year>
              <effective_date><%= request[:data][:effective_date] %></effective_date>
              <premium><%= '%.2f' % request[:data][:premium] %></premium>
              <premium_pif><%= '%.2f' % request[:data][:premium_pif] %></premium_pif>
              <num_insured><%= request[:data][:num_insured] %></num_insured>
              <lia_amount><%= '%.2f' % request[:data][:lia_amount] %></lia_amount>
            </request>
          </renters_request>
        ]]>
      </xmldata>
    </proc:processRenterRequest>
  </soapenv:Body>
</soapenv:Envelope>
